---
kind: type
id: T:Autodesk.Revit.Exceptions.InvalidDataStreamException
source: html/5501eca1-70f1-3204-fda2-d6abc4e33e03.htm
---
# Autodesk.Revit.Exceptions.InvalidDataStreamException

The exception that is thrown when the reading or saving operation failed due to parsing error.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class InvalidDataStreamException : IOException
```